//Локальные функции 
///TODO: Вставить параметры
///TODO: Получить соединение
///TODO: Получить токен

//Глобальные функции

///Проекты
////TODO: Получить список всех проектов
////TODO: Создать новый проект
////TODO: Получить проект
////TODO: Обновить проект
////TODO: Удалить проект
////TODO: Получить участников проекта

///Секции
////TODO: Получить список всех секций
////TODO: Создать новую секцию
////TODO: Получить секцию
////TODO: Обновить секцию
////TODO: Удалить секцию

///Задачи
////TODO: Получить список активных задач
////TODO: Создать новую задачу
////TODO: Получить задачу
////TODO: Обновить задачу
////TODO: Закрыть задачу
////TODO: Активировать закрытую задачу
////TODO: Удалить задачу

///Комментарии
////TODO: Получить список всех комментариев задачи
////TODO: Получить список всех комментариев проекта
////TODO: Создать новый комментарий
////TODO: Получить комментарий
////TODO: Обновить комментарий
////TODO: Удалить комментарий

///Метки
////TODO: Получить все личные метки
////TODO: Создать новую личную метку
////TODO: Получить личную метку
////TODO: Обновить личную метку
////TODO: Удалить личную метку
////TODO: Получить все общие метки
////TODO: Переименовать общую метку
////TODO: Удалить общую метку