
&НаКлиенте
Процедура Команда1(Команда)
	СтруктураДанных = Todoist_Клиент.ПолучитьСтруктуруДанных(2);
	СтруктураДанных.Содержание = "Новая задача созданная при помощи шаблона";
	СтруктураДанных.ИдентификаторРодителя = "6210206577";
	//
	Метки = Новый Массив;
	Метки.Добавить("Work");
	//
	СтруктураДанных.Метки = Метки;
	СтруктураДанных.Приоритет = 4;
	СтруктураДанных.Описание = "Новое описание созданное при помощи шаблона";
	//
	Задача = Todoist_Клиент.СоздатьНовуюЗадачу(СтруктураДанных);
КонецПроцедуры
