&НаКлиенте
Процедура ОбновитьПроекты()
	Проекты = Todoist_Клиент.ПолучитьСписокВсехПроектов();
	Для Каждого Проект Из Проекты Цикл
		ТС = СписокПроектов.Добавить();
		ТС.Идентификатор = Проект.Идентификатор;
		ТС.Название = Проект.Название;
		ТС.КоличествоКомментариев = Проект.КоличествоКомментариев;
		ТС.ПорядковыйНомер = Проект.ПорядковыйНомер;
		ТС.Цвет = Проект.Цвет;
		ТС.Общий = Проект.Общий;
		ТС.Избранное = Проект.Избранное;
		ТС.Входящие = Проект.Входящие;
		ТС.ВходящиеКоманды = Проект.ВходящиеКоманды;
		ТС.СпособОтображения = Проект.СпособОтображения;
		ТС.Ссылка = Проект.Ссылка;
		ТС.ИдентификаторРодителя = Проект.ИдентификаторРодителя;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПроекты();
КонецПроцедуры

&НаКлиенте
Процедура СписокПроектовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПроектовПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
